randrw/2-node/randrw4.log
random-writers: (g=0): rw=randrw, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=libaio, iodepth=4
...
fio-3.27-32-g77c7-dirty
Starting 4 processes
random-writers: (g=0): rw=randrw, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=libaio, iodepth=4
...
fio-3.27-32-g77c7-dirty
Starting 4 processes
random-writers: Laying out IO file (1 file / 1024MiB)
random-writers: Laying out IO file (1 file / 1024MiB)

random-writers: (groupid=0, jobs=1): err= 0: pid=174619: Tue Jul 13 12:16:51 2021
  read: IOPS=518, BW=16.2MiB/s (17.0MB/s)(4865MiB/300002msec)
    slat (usec): min=15, max=413426, avg=1631.11, stdev=4633.54
    clat (usec): min=13, max=1019.4k, avg=2920.75, stdev=11417.57
     lat (usec): min=103, max=1020.4k, avg=4554.01, stdev=12849.86
    clat percentiles (usec):
     |  1.00th=[   441],  5.00th=[   578], 10.00th=[   652], 20.00th=[  1221],
     | 30.00th=[  1352], 40.00th=[  1483], 50.00th=[  1745], 60.00th=[  2024],
     | 70.00th=[  2278], 80.00th=[  2671], 90.00th=[  5735], 95.00th=[  9372],
     | 99.00th=[ 16909], 99.50th=[ 26870], 99.90th=[ 87557], 99.95th=[121111],
     | 99.99th=[467665]
   bw (  KiB/s): min=  448, max=29696, per=25.77%, avg=16861.51, stdev=7265.94, samples=590
   iops        : min=   14, max=  928, avg=526.92, stdev=227.06, samples=590
  write: IOPS=519, BW=16.2MiB/s (17.0MB/s)(4868MiB/300002msec); 0 zone resets
    slat (usec): min=120, max=3298, avg=206.47, stdev=41.35
    clat (usec): min=86, max=1020.1k, avg=2870.11, stdev=10530.08
     lat (usec): min=228, max=1020.3k, avg=3077.98, stdev=10530.71
    clat percentiles (usec):
     |  1.00th=[   408],  5.00th=[   545], 10.00th=[   594], 20.00th=[  1205],
     | 30.00th=[  1319], 40.00th=[  1450], 50.00th=[  1696], 60.00th=[  2024],
     | 70.00th=[  2245], 80.00th=[  2671], 90.00th=[  5735], 95.00th=[  9372],
     | 99.00th=[ 16450], 99.50th=[ 25822], 99.90th=[ 88605], 99.95th=[128451],
     | 99.99th=[320865]
   bw (  KiB/s): min=  192, max=32768, per=25.74%, avg=16873.87, stdev=7345.64, samples=590
   iops        : min=    6, max= 1024, avg=527.31, stdev=229.55, samples=590
  lat (usec)   : 20=0.01%, 100=0.01%, 250=0.04%, 500=2.66%, 750=12.41%
  lat (usec)   : 1000=1.00%
  lat (msec)   : 2=42.88%, 4=28.72%, 10=8.17%, 20=3.41%, 50=0.45%
  lat (msec)   : 100=0.17%, 250=0.06%, 500=0.01%, 1000=0.01%, 2000=0.01%
  cpu          : usr=2.09%, sys=24.19%, ctx=143287, majf=0, minf=44
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=155668,155774,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4
random-writers: (groupid=0, jobs=1): err= 0: pid=174620: Tue Jul 13 12:16:51 2021
  read: IOPS=514, BW=16.1MiB/s (16.9MB/s)(4824MiB/300004msec)
    slat (usec): min=15, max=375025, avg=1645.65, stdev=4717.83
    clat (usec): min=14, max=1036.4k, avg=2926.89, stdev=11615.56
     lat (usec): min=105, max=1037.4k, avg=4574.67, stdev=13119.17
    clat percentiles (usec):
     |  1.00th=[   437],  5.00th=[   578], 10.00th=[   644], 20.00th=[  1205],
     | 30.00th=[  1336], 40.00th=[  1450], 50.00th=[  1696], 60.00th=[  2008],
     | 70.00th=[  2212], 80.00th=[  2671], 90.00th=[  5932], 95.00th=[  9372],
     | 99.00th=[ 16909], 99.50th=[ 29230], 99.90th=[ 89654], 99.95th=[128451],
     | 99.99th=[429917]
   bw (  KiB/s): min=  320, max=30400, per=25.55%, avg=16717.34, stdev=7323.12, samples=590
   iops        : min=   10, max=  950, avg=522.42, stdev=228.85, samples=590
  write: IOPS=516, BW=16.1MiB/s (16.9MB/s)(4840MiB/300004msec); 0 zone resets
    slat (usec): min=121, max=3113, avg=206.58, stdev=41.05
    clat (usec): min=84, max=1042.0k, avg=2905.35, stdev=10792.13
     lat (usec): min=249, max=1042.1k, avg=3113.40, stdev=10793.50
    clat percentiles (usec):
     |  1.00th=[   404],  5.00th=[   545], 10.00th=[   594], 20.00th=[  1188],
     | 30.00th=[  1303], 40.00th=[  1418], 50.00th=[  1647], 60.00th=[  1991],
     | 70.00th=[  2212], 80.00th=[  2671], 90.00th=[  5997], 95.00th=[  9372],
     | 99.00th=[ 17171], 99.50th=[ 29230], 99.90th=[ 89654], 99.95th=[137364],
     | 99.99th=[362808]
   bw (  KiB/s): min=   64, max=31360, per=25.59%, avg=16777.11, stdev=7472.26, samples=590
   iops        : min=    2, max=  980, avg=524.28, stdev=233.51, samples=590
  lat (usec)   : 20=0.01%, 100=0.01%, 250=0.04%, 500=2.88%, 750=12.38%
  lat (usec)   : 1000=1.16%
  lat (msec)   : 2=43.47%, 4=27.35%, 10=8.62%, 20=3.34%, 50=0.48%
  lat (msec)   : 100=0.18%, 250=0.06%, 500=0.01%, 1000=0.01%, 2000=0.01%
  cpu          : usr=2.01%, sys=23.87%, ctx=141027, majf=0, minf=44
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=154364,154883,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4
random-writers: (groupid=0, jobs=1): err= 0: pid=174621: Tue Jul 13 12:16:51 2021
  read: IOPS=508, BW=15.9MiB/s (16.7MB/s)(4770MiB/300002msec)
    slat (usec): min=15, max=407278, avg=1674.87, stdev=4966.84
    clat (usec): min=17, max=1003.1k, avg=2980.94, stdev=11302.57
     lat (usec): min=99, max=1004.1k, avg=4657.91, stdev=12857.97
    clat percentiles (usec):
     |  1.00th=[   392],  5.00th=[   529], 10.00th=[   603], 20.00th=[  1139],
     | 30.00th=[  1319], 40.00th=[  1450], 50.00th=[  1663], 60.00th=[  2008],
     | 70.00th=[  2278], 80.00th=[  2769], 90.00th=[  6456], 95.00th=[  9634],
     | 99.00th=[ 17433], 99.50th=[ 28181], 99.90th=[ 92799], 99.95th=[135267],
     | 99.99th=[346031]
   bw (  KiB/s): min=  192, max=30208, per=25.27%, avg=16532.07, stdev=7071.02, samples=590
   iops        : min=    6, max=  944, avg=516.63, stdev=220.97, samples=590
  write: IOPS=507, BW=15.9MiB/s (16.6MB/s)(4762MiB/300002msec); 0 zone resets
    slat (usec): min=120, max=3294, avg=201.74, stdev=41.78
    clat (usec): min=84, max=1002.5k, avg=2932.19, stdev=11052.84
     lat (usec): min=219, max=1002.7k, avg=3135.30, stdev=11053.65
    clat percentiles (usec):
     |  1.00th=[   359],  5.00th=[   478], 10.00th=[   562], 20.00th=[  1123],
     | 30.00th=[  1303], 40.00th=[  1418], 50.00th=[  1598], 60.00th=[  2008],
     | 70.00th=[  2245], 80.00th=[  2737], 90.00th=[  6390], 95.00th=[  9634],
     | 99.00th=[ 17433], 99.50th=[ 26870], 99.90th=[ 93848], 99.95th=[135267],
     | 99.99th=[367002]
   bw (  KiB/s): min=  192, max=33472, per=25.17%, avg=16501.69, stdev=7168.88, samples=590
   iops        : min=    6, max= 1046, avg=515.68, stdev=224.03, samples=590
  lat (usec)   : 20=0.01%, 100=0.04%, 250=0.14%, 500=4.66%, 750=12.76%
  lat (usec)   : 1000=0.83%
  lat (msec)   : 2=41.29%, 4=26.68%, 10=9.19%, 20=3.67%, 50=0.51%
  lat (msec)   : 100=0.16%, 250=0.06%, 500=0.01%, 1000=0.01%, 2000=0.01%
  cpu          : usr=1.90%, sys=23.10%, ctx=133241, majf=0, minf=43
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=152632,152372,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4
random-writers: (groupid=0, jobs=1): err= 0: pid=174622: Tue Jul 13 12:16:51 2021
  read: IOPS=502, BW=15.7MiB/s (16.5MB/s)(4710MiB/300001msec)
    slat (usec): min=15, max=397138, avg=1690.18, stdev=4915.98
    clat (usec): min=80, max=1012.9k, avg=3020.72, stdev=11818.45
     lat (usec): min=100, max=1014.2k, avg=4713.39, stdev=13317.98
    clat percentiles (usec):
     |  1.00th=[   404],  5.00th=[   545], 10.00th=[   619], 20.00th=[  1172],
     | 30.00th=[  1352], 40.00th=[  1516], 50.00th=[  1729], 60.00th=[  2057],
     | 70.00th=[  2376], 80.00th=[  2802], 90.00th=[  6194], 95.00th=[  9634],
     | 99.00th=[ 17695], 99.50th=[ 28443], 99.90th=[ 91751], 99.95th=[135267],
     | 99.99th=[851444]
   bw (  KiB/s): min=  128, max=31232, per=24.92%, avg=16302.78, stdev=7499.04, samples=591
   iops        : min=    4, max=  976, avg=509.46, stdev=234.34, samples=591
  write: IOPS=505, BW=15.8MiB/s (16.6MB/s)(4737MiB/300001msec); 0 zone resets
    slat (usec): min=121, max=3098, avg=207.51, stdev=45.43
    clat (usec): min=11, max=1013.0k, avg=2946.17, stdev=10409.94
     lat (usec): min=218, max=1013.2k, avg=3155.00, stdev=10411.03
    clat percentiles (usec):
     |  1.00th=[   371],  5.00th=[   494], 10.00th=[   570], 20.00th=[  1156],
     | 30.00th=[  1336], 40.00th=[  1467], 50.00th=[  1663], 60.00th=[  2040],
     | 70.00th=[  2343], 80.00th=[  2802], 90.00th=[  6128], 95.00th=[  9634],
     | 99.00th=[ 17695], 99.50th=[ 28705], 99.90th=[ 84411], 99.95th=[129500],
     | 99.99th=[337642]
   bw (  KiB/s): min=  192, max=32384, per=25.01%, avg=16395.80, stdev=7617.66, samples=591
   iops        : min=    6, max= 1012, avg=512.37, stdev=238.05, samples=591
  lat (usec)   : 20=0.01%, 100=0.02%, 250=0.11%, 500=4.16%, 750=12.87%
  lat (usec)   : 1000=0.82%
  lat (msec)   : 2=40.28%, 4=28.65%, 10=8.57%, 20=3.72%, 50=0.55%
  lat (msec)   : 100=0.16%, 250=0.06%, 500=0.01%, 1000=0.01%, 2000=0.01%
  cpu          : usr=2.12%, sys=24.00%, ctx=132804, majf=0, minf=43
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=150720,151579,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
   READ: bw=63.9MiB/s (67.0MB/s), 15.7MiB/s-16.2MiB/s (16.5MB/s-17.0MB/s), io=18.7GiB (20.1GB), run=300001-300004msec
  WRITE: bw=64.0MiB/s (67.1MB/s), 15.8MiB/s-16.2MiB/s (16.6MB/s-17.0MB/s), io=18.8GiB (20.1GB), run=300001-300004msec

random-writers: (groupid=0, jobs=1): err= 0: pid=148847: Tue Jul 13 12:17:05 2021
  read: IOPS=476, BW=14.9MiB/s (15.6MB/s)(4469MiB/300001msec)
    slat (usec): min=15, max=350782, avg=1790.10, stdev=4793.72
    clat (usec): min=21, max=1011.4k, avg=3204.56, stdev=12060.38
     lat (usec): min=101, max=1016.8k, avg=4997.53, stdev=13575.11
    clat percentiles (usec):
     |  1.00th=[   457],  5.00th=[   594], 10.00th=[   685], 20.00th=[  1270],
     | 30.00th=[  1450], 40.00th=[  1614], 50.00th=[  1860], 60.00th=[  2180],
     | 70.00th=[  2507], 80.00th=[  2966], 90.00th=[  6587], 95.00th=[  9896],
     | 99.00th=[ 19006], 99.50th=[ 30802], 99.90th=[ 92799], 99.95th=[158335],
     | 99.99th=[910164]
   bw (  KiB/s): min=  384, max=28288, per=25.73%, avg=15460.40, stdev=7473.89, samples=591
   iops        : min=   12, max=  884, avg=483.11, stdev=233.57, samples=591
  write: IOPS=477, BW=14.9MiB/s (15.6MB/s)(4475MiB/300001msec); 0 zone resets
    slat (usec): min=120, max=3086, avg=214.17, stdev=48.69
    clat (usec): min=84, max=1015.4k, avg=3097.97, stdev=10168.46
     lat (usec): min=220, max=1015.6k, avg=3313.53, stdev=10169.15
    clat percentiles (usec):
     |  1.00th=[   404],  5.00th=[   537], 10.00th=[   586], 20.00th=[  1254],
     | 30.00th=[  1401], 40.00th=[  1549], 50.00th=[  1811], 60.00th=[  2180],
     | 70.00th=[  2474], 80.00th=[  2933], 90.00th=[  6587], 95.00th=[  9896],
     | 99.00th=[ 18744], 99.50th=[ 27919], 99.90th=[ 88605], 99.95th=[139461],
     | 99.99th=[299893]
   bw (  KiB/s): min=  256, max=29120, per=25.73%, avg=15481.43, stdev=7545.81, samples=591
   iops        : min=    8, max=  910, avg=483.76, stdev=235.82, samples=591
  lat (usec)   : 50=0.01%, 100=0.01%, 250=0.05%, 500=2.39%, 750=12.35%
  lat (usec)   : 1000=1.09%
  lat (msec)   : 2=38.69%, 4=31.62%, 10=8.91%, 20=4.03%, 50=0.59%
  lat (msec)   : 100=0.19%, 250=0.06%, 500=0.01%, 1000=0.01%, 2000=0.01%
  cpu          : usr=2.15%, sys=24.06%, ctx=131912, majf=0, minf=44
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=143004,143189,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4
random-writers: (groupid=0, jobs=1): err= 0: pid=148848: Tue Jul 13 12:17:05 2021
  read: IOPS=476, BW=14.9MiB/s (15.6MB/s)(4469MiB/300001msec)
    slat (usec): min=16, max=342030, avg=1799.35, stdev=4863.02
    clat (usec): min=24, max=1057.0k, avg=3151.25, stdev=11478.25
     lat (usec): min=109, max=1058.3k, avg=4952.86, stdev=13097.30
    clat percentiles (usec):
     |  1.00th=[   465],  5.00th=[   603], 10.00th=[   668], 20.00th=[  1254],
     | 30.00th=[  1385], 40.00th=[  1516], 50.00th=[  1844], 60.00th=[  2089],
     | 70.00th=[  2343], 80.00th=[  2835], 90.00th=[  6849], 95.00th=[ 10028],
     | 99.00th=[ 19006], 99.50th=[ 30540], 99.90th=[ 90702], 99.95th=[137364],
     | 99.99th=[367002]
   bw (  KiB/s): min=  513, max=29056, per=25.74%, avg=15461.49, stdev=7895.07, samples=591
   iops        : min=   16, max=  908, avg=483.14, stdev=246.72, samples=591
  write: IOPS=478, BW=14.9MiB/s (15.7MB/s)(4483MiB/300001msec); 0 zone resets
    slat (usec): min=121, max=3978, avg=207.58, stdev=38.91
    clat (usec): min=88, max=1056.8k, avg=3144.32, stdev=11065.81
     lat (usec): min=258, max=1057.0k, avg=3353.45, stdev=11066.56
    clat percentiles (usec):
     |  1.00th=[   424],  5.00th=[   562], 10.00th=[   611], 20.00th=[  1237],
     | 30.00th=[  1352], 40.00th=[  1500], 50.00th=[  1844], 60.00th=[  2089],
     | 70.00th=[  2343], 80.00th=[  2835], 90.00th=[  6915], 95.00th=[ 10028],
     | 99.00th=[ 18744], 99.50th=[ 30016], 99.90th=[ 96994], 99.95th=[160433],
     | 99.99th=[329253]
   bw (  KiB/s): min=  192, max=29632, per=25.78%, avg=15512.88, stdev=8001.73, samples=591
   iops        : min=    6, max=  926, avg=484.74, stdev=250.05, samples=591
  lat (usec)   : 50=0.01%, 100=0.01%, 250=0.02%, 500=1.96%, 750=12.40%
  lat (usec)   : 1000=0.85%
  lat (msec)   : 2=40.50%, 4=29.90%, 10=9.31%, 20=4.15%, 50=0.63%
  lat (msec)   : 100=0.18%, 250=0.07%, 500=0.01%, 1000=0.01%, 2000=0.01%
  cpu          : usr=1.91%, sys=22.50%, ctx=134281, majf=0, minf=44
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=142996,143456,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4
random-writers: (groupid=0, jobs=1): err= 0: pid=148849: Tue Jul 13 12:17:05 2021
  read: IOPS=456, BW=14.3MiB/s (15.0MB/s)(4284MiB/300002msec)
    slat (usec): min=15, max=325432, avg=1881.11, stdev=4980.57
    clat (usec): min=24, max=971228, avg=3320.14, stdev=11199.97
     lat (usec): min=105, max=972234, avg=5204.38, stdev=12822.28
    clat percentiles (usec):
     |  1.00th=[   420],  5.00th=[   570], 10.00th=[   668], 20.00th=[  1270],
     | 30.00th=[  1467], 40.00th=[  1631], 50.00th=[  1860], 60.00th=[  2278],
     | 70.00th=[  2573], 80.00th=[  3228], 90.00th=[  7439], 95.00th=[ 10421],
     | 99.00th=[ 19268], 99.50th=[ 31589], 99.90th=[ 87557], 99.95th=[125305],
     | 99.99th=[325059]
   bw (  KiB/s): min=  512, max=28864, per=24.67%, avg=14818.05, stdev=7224.70, samples=591
   iops        : min=   16, max=  902, avg=463.03, stdev=225.77, samples=591
  write: IOPS=455, BW=14.2MiB/s (14.9MB/s)(4269MiB/300002msec); 0 zone resets
    slat (usec): min=119, max=2409, avg=214.87, stdev=49.08
    clat (usec): min=86, max=966571, avg=3270.24, stdev=10896.98
     lat (usec): min=222, max=966748, avg=3486.47, stdev=10897.53
    clat percentiles (usec):
     |  1.00th=[   371],  5.00th=[   510], 10.00th=[   570], 20.00th=[  1221],
     | 30.00th=[  1401], 40.00th=[  1549], 50.00th=[  1778], 60.00th=[  2212],
     | 70.00th=[  2507], 80.00th=[  3163], 90.00th=[  7373], 95.00th=[ 10290],
     | 99.00th=[ 19268], 99.50th=[ 32375], 99.90th=[ 94897], 99.95th=[147850],
     | 99.99th=[312476]
   bw (  KiB/s): min=  512, max=28992, per=24.54%, avg=14763.24, stdev=7335.26, samples=591
   iops        : min=   16, max=  906, avg=461.32, stdev=229.23, samples=591
  lat (usec)   : 50=0.01%, 100=0.03%, 250=0.11%, 500=3.37%, 750=12.63%
  lat (usec)   : 1000=0.91%
  lat (msec)   : 2=36.68%, 4=30.60%, 10=10.13%, 20=4.64%, 50=0.64%
  lat (msec)   : 100=0.20%, 250=0.06%, 500=0.01%, 1000=0.01%
  cpu          : usr=2.12%, sys=23.25%, ctx=123356, majf=0, minf=43
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=137087,136601,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4
random-writers: (groupid=0, jobs=1): err= 0: pid=148850: Tue Jul 13 12:17:05 2021
  read: IOPS=467, BW=14.6MiB/s (15.3MB/s)(4379MiB/300005msec)
    slat (usec): min=15, max=354598, avg=1839.80, stdev=4829.05
    clat (usec): min=19, max=1034.8k, avg=3241.48, stdev=11774.92
     lat (usec): min=108, max=1035.7k, avg=5083.58, stdev=13268.20
    clat percentiles (usec):
     |  1.00th=[   453],  5.00th=[   594], 10.00th=[   668], 20.00th=[  1270],
     | 30.00th=[  1401], 40.00th=[  1565], 50.00th=[  1876], 60.00th=[  2147],
     | 70.00th=[  2442], 80.00th=[  2966], 90.00th=[  7111], 95.00th=[ 10159],
     | 99.00th=[ 19006], 99.50th=[ 31589], 99.90th=[ 92799], 99.95th=[132645],
     | 99.99th=[358613]
   bw (  KiB/s): min=  128, max=32704, per=25.22%, avg=15150.70, stdev=7098.02, samples=591
   iops        : min=    4, max= 1022, avg=473.43, stdev=221.82, samples=591
  write: IOPS=469, BW=14.7MiB/s (15.4MB/s)(4401MiB/300005msec); 0 zone resets
    slat (usec): min=122, max=2753, avg=208.65, stdev=42.56
    clat (usec): min=83, max=1044.9k, avg=3177.72, stdev=10542.48
     lat (usec): min=223, max=1045.2k, avg=3387.84, stdev=10543.38
    clat percentiles (usec):
     |  1.00th=[   412],  5.00th=[   553], 10.00th=[   611], 20.00th=[  1254],
     | 30.00th=[  1369], 40.00th=[  1516], 50.00th=[  1860], 60.00th=[  2114],
     | 70.00th=[  2409], 80.00th=[  2966], 90.00th=[  7177], 95.00th=[ 10159],
     | 99.00th=[ 19006], 99.50th=[ 31851], 99.90th=[ 85459], 99.95th=[127402],
     | 99.99th=[333448]
   bw (  KiB/s): min=  192, max=31616, per=25.31%, avg=15225.24, stdev=7244.44, samples=591
   iops        : min=    6, max=  988, avg=475.75, stdev=226.39, samples=591
  lat (usec)   : 20=0.01%, 100=0.01%, 250=0.05%, 500=2.00%, 750=12.08%
  lat (usec)   : 1000=1.01%
  lat (msec)   : 2=39.16%, 4=30.60%, 10=9.78%, 20=4.42%, 50=0.61%
  lat (msec)   : 100=0.20%, 250=0.06%, 500=0.01%, 1000=0.01%, 2000=0.01%
  cpu          : usr=1.96%, sys=22.28%, ctx=131923, majf=0, minf=44
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=140129,140818,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
   READ: bw=58.7MiB/s (61.5MB/s), 14.3MiB/s-14.9MiB/s (15.0MB/s-15.6MB/s), io=17.2GiB (18.5GB), run=300001-300005msec
  WRITE: bw=58.8MiB/s (61.6MB/s), 14.2MiB/s-14.9MiB/s (14.9MB/s-15.7MB/s), io=17.2GiB (18.5GB), run=300001-300005msec


Batch Job Summary Report (version 21.01.1) for Job "fioRandrw" (1470610) on tave

Job information (1/2)
-----------------------------------------------------------------------------------------------------
             Submit            Eligible               Start                 End    Elapsed Time limit
------------------- ------------------- ------------------- ------------------- ---------- ----------
2021-07-13T12:11:47 2021-07-13T12:11:47 2021-07-13T12:11:47 2021-07-13T12:17:08   00:05:21   00:15:00
-----------------------------------------------------------------------------------------------------

Job information (2/2)
-------------------------------------------------------------
    Username      Account    Partition   NNodes        Energy
------------ ------------ ------------ -------- -------------
    afilipci         g138       normal        2     83.726 kJ